# Section 6: Python for Data Analysis - Pandas

# 08 - Operations

In [26]:
##In this lecture we are going to review some of the operations with Pandas and learn about some other useful 
##operations. 

import numpy as np
import pandas as pd

In [27]:
df = pd.DataFrame({'col1':[1,2,3,4], 
                   'col2':[444,555,666,444], 
                   'col3':['abc', 'def', 'ghi', 'xyz']})

df.head() ##Outputs the specified number of rows from the calling Data Frame - Pass an int as argument

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [28]:
### Finding unique values - Three useful methods 

## 1 - .unique() -> Returns all the unique values in a specified column as a np.array
df['col2'].unique()

array([444, 555, 666])

In [29]:
## We obtain the number of unique of values calling the len() method of the above result
len(df['col2'].unique())

3

In [30]:
## 2 - .nunique()
## We use the nunique() method to do the above in a single step 

df['col2'].nunique()

3

In [31]:
## 3 - .value_counts() -> Returns a table of the occurence of unique values as a table, e.g. 

df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [32]:
### Review of conditional selection 

df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [33]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [34]:
## Recall that df['col1']>1 is a boolean Series 

df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [35]:
### Using multiple conditions 

df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [36]:
### THe apply method -> One of the most powerful methods in your Pandas toolbox 

##Consider the function

def times2(x):
    return x*2

In [37]:
### Recall that we can call built-in functions from Data Frame columns as follows: 

df['col1'].sum()

10

In [38]:
### Now, what if you want to apply your own custom function such as times2()?

##We can do so using the .apply() method passing the function we want to apply as an argument: 

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [39]:
###We can also pass built-in functions, e.g., obtaining the length of each String in column 3

df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [40]:
### The .apply() method canbe specially powerful when use it with lambda expressions -> No need to define the function

df['col2'].apply(lambda x:x**2) ##Square each value in column 2

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [41]:
##Removing columns 

##Using the drop method 
df.drop('col1', axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [42]:
##Dropping a row 
df.drop(0)

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [43]:
###Obtaining column and index names of a Data Frame -> Atributes of the Data Frame itself 

df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [44]:
df.index ##We have a range index

RangeIndex(start=0, stop=4, step=1)

In [45]:
###Sorting a Data Frame 
df.sort_values(by = 'col2') ##Pass in the column you want to sort by - Index is attached to the new sorted rows!

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [46]:
##Finding null NaN values in your Data Frame
df.isnull() ##Returns a boolean Data Frame indicating whether the values were null or not

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [47]:
### Pivot table 

data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [48]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [51]:
df.pivot_table(values = 'D', index = ['A','B'], columns = ['C'] ) ##Takes three arguments: values, index and columns

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN